{
  "UserFacingFeatures": {
    "questions": [
      "How do I create an account?",
      "How do I reset my password?",
      "How do I navigate the platform?",
      "How can I update my personal information?"
    ],
    "supportScenarios": [
      "User is unable to log in",
      "User is unable to navigate the platform",
      "User is unable to update personal information"
    ],
    "featureExplanations": [
      "Explaining the account creation process",
      "Explaining the password reset process",
      "Explaining how to navigate the platform",
      "Explaining how to update personal information"
    ]
  },
  "CommonProblems": {
    "questions": [
      "Why can't I log in?",
      "Why can't I update my personal information?",
      "Why is the platform not loading?",
      "Why am I not receiving email notifications?"
    ],
    "supportScenarios": [
      "User is unable to log in due to incorrect password",
      "User is unable to update personal information due to system error",
      "Platform is not loading due to server issues",
      "User is not receiving email notifications due to incorrect email settings"
    ],
    "featureExplanations": [
      "Explaining the login process and common issues",
      "Explaining the personal information update process and common issues",
      "Explaining potential server issues",
      "Explaining email notification settings and common issues"
    ]
  },
  "IntegrationQuestions": {
    "questions": [
      "How do I integrate MyMoolah with my bank account?",
      "How do I integrate MyMoolah with my credit card?",
      "How do I integrate MyMoolah with my accounting software?"
    ],
    "supportScenarios": [
      "User is unable to integrate MyMoolah with bank account",
      "User is unable to integrate MyMoolah with credit card",
      "User is unable to integrate MyMoolah with accounting software"
    ],
    "featureExplanations": [
      "Explaining the process of integrating MyMoolah with a bank account",
      "Explaining the process of integrating MyMoolah with a credit card",
      "Explaining the process of integrating MyMoolah with accounting software"
    ]
  }
}